# IsParameterLockable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..IsParameterLockable Method
FamilyManager Class See Also
---
For Conceptual Mass and Curtain Panel families, indicate whether the specified parameter can be locked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsParameterLockable(
	FamilyParameter familyParameter
)
```

Visual Basic
---
```text
Public Function IsParameterLockable ( _
	familyParameter As FamilyParameter _
) As Boolean
```

Visual C++
---
```text
public:
bool IsParameterLockable(
	FamilyParameter^ familyParameter
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameter
# ### Return Value
True if the family is a Conceptual Mass or Curtain Panel Family and the parameter drives one or more dimensions; false otherwise.
# See Also
FamilyManager Class
Autodesk.Revit.DB Namespace